sng4_manager.org
#+TITLE:  SNG4 Manager Configuration
#+AUTHOR: Xavier Garrido
#+DATE:   2013-02-24
#+OPTIONS: ^:{}
#+STARTUP: entitiespretty

* Introduction

The =mctools/g4= library provides a Geant4 standard interface to generate simulated
data. A dedicated manager class addresses all the resources needed to :

- describe the geometry (through a geometry manager from the [[https://nemo.lpc-caen.in2p3.fr/wiki/sngeometry][sngeometry]]
  library, a geometry service is also usable)
- randomize the primary events to be tracked by Geant4 in the virtual geometry
  model (using the [[https://nemo.lpc-caen.in2p3.fr/wiki/genbb_help][genbb_help]] library)
- randomize the primary vertex from which the primary events originate (using
  the [[https://nemo.lpc-caen.in2p3.fr/wiki/genvtx][genvtx]] library)
- setup Geant4 embeded utilities to handle the production of true hits

More details concerning the use of =mctools= binaries and Monte-Carlo production
can be found in [[https://nemo.lpc-caen.in2p3.fr/wiki/SNSW_SNailWare_FAQ#Monte-Carloproduction][SN@ilWare wiki]].

* Manager configuration
:PROPERTIES:
:TANGLE: sng4_manager.conf
:END:

This section describe almost entirely the whole set of options to setup =sng4=
manager. Each relevant part is split into a unique item which ease the
navigation as well as the configuration. The most *important* code block is the
next one which allows the reading of this file by =datatools::properties= object.

#+BEGIN_SRC shell
  #@description A sample list of setups for Geant4
  #@key_label   "name"
  #@meta_label  ""
#+END_SRC

** Main configuration level
Here, general options such as verbosity, debug flags are passed to sng4
manager. By the way, some of these options can be overloaded by the
=sng4_module= which configuration can be changed in [[file:simulation_config.org][the main simulation file]].
#+BEGIN_SRC shell
  [name="manager"]

  #@description Logging priority
  logging.priority      : string = "warning"

  #@description Geant4 tracking verbosity flag (from 0 to 10):
  g4_tracking_verbosity : integer = 0

  #@description Geant4 visualization activation flag:
  g4_visualization      : boolean = false
#+END_SRC

** Event generator
The following code holds the =genbb= manager to give access to several primary
generators from neutrinoless double beta decay, to\nbsp^{214}Bi/^{208}Tl contamination or
cosmic muon generator. See [[file:sngenbb_manager.org][sngenbb manager]] file.
#+BEGIN_SRC shell
  [name="event_generator"]

  #@description Configuration file for the embedded '::genbb::manager'
  manager.config : string as path = \
      "@configuration:sngenbb_manager.conf"
#+END_SRC

** Vertex generation
This part basically provides the location of vertex generator implemented by
[[https://nemo.lpc-caen.in2p3.fr/wiki/genvtx][genvtx]]. See [[file:sngenvertex_manager.org][sngenvertex manager]] file.
#+BEGIN_SRC shell
  [name="vertex_generator"]

  #@description Main configuration file for the vertex generator manager
  manager.config : string as path = \
      "@configuration:sngenvertex_manager.conf"
#+END_SRC

** Detector construction
Main configuration file for the detector construction user object.
#+BEGIN_SRC shell
  [name="detector_construction"]
#+END_SRC
*** Logging priority
#+BEGIN_SRC shell
  #@description Logging priority
  logging.priority : string = "fatal"
#+END_SRC

*** GDML scheme and options
The Geometry Description Markup Language is an application-indepedent geometry
description format based on XML[1]. It is used as Geant4 toolkit bindings
through =gemotools= converters.

#+BEGIN_SRC shell
  #@description Temporary directory for GDML file generation:
  gdml.tmp_dir         : string as path = "/tmp/${USER}/snemo_demo_g4.d"

  #@description Access mode to the GDML schema ("local" or "remote")
  gdml.schema_location : string = "local" # "remote"

  #@description Flag to skip GDML validation
  gdml.no_validation   : boolean = false
#+END_SRC

[1] http://gdml.web.cern.ch/GDML

*** Step hit processors
Step hit processors are used to convert Geant4 steps into detector hits for
SuperNEMO physics.
#+BEGIN_SRC shell
  #@description Logging support for step hit processor factory
  hit_processor_factory.logging.priority : string = "warning"

  #@description Configuration file for the step hit processor factory:
  hit_processor_factory.config : string as path = \
      "@configuration:step_hit_processor_manager.conf"
#+END_SRC

