sng4_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>SNG4 Manager Configuration</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
 <a href="https://github.com/xgarrido/snemo_simulation_configuration"><i class="fa fa-github"></i></a><br/> 
</div>
<div id="content">
<h1 class="title">SNG4 Manager Configuration</h1>
<div id="table-of-contents">
<h2></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline33">2. Manager configuration</a>
<ul>
<li><a href="#orgheadline2">2.1. Main configuration level</a></li>
<li><a href="#orgheadline3">2.2. Event generator</a></li>
<li><a href="#orgheadline4">2.3. Vertex generation</a></li>
<li><a href="#orgheadline12">2.4. Detector construction</a></li>
<li><a href="#orgheadline25">2.5. Physics list</a></li>
<li><a href="#orgheadline32">2.6. Geant4 related action</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>mctools/g4</code> library provides a Geant4 standard interface to generate simulated
data. A dedicated manager class addresses all the resources needed to :
</p>

<ul class="org-ul">
<li>describe the geometry (through a geometry manager from the <a href="https://nemo.lpc-caen.in2p3.fr/wiki/sngeometry">sngeometry</a>
  library, a geometry service is also usable)</li>
<li>randomize the primary events to be tracked by Geant4 in the virtual geometry
model (using the <a href="https://nemo.lpc-caen.in2p3.fr/wiki/genbb_help">genbb_help</a> library)</li>
<li>randomize the primary vertex from which the primary events originate (using
the <a href="https://nemo.lpc-caen.in2p3.fr/wiki/genvtx">genvtx</a> library)</li>
<li>setup Geant4 embeded utilities to handle the production of true hits</li>
</ul>

<p>
More details concerning the use of <code>mctools</code> binaries and Monte-Carlo production
can be found in <a href="https://nemo.lpc-caen.in2p3.fr/wiki/SNSW_SNailWare_FAQ#Monte-Carloproduction">SN@ilWare wiki</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">2</span> Manager configuration</h2>
<div class="outline-text-2" id="text-2">
<p>
This section describe almost entirely the whole set of options to setup <code>sng4</code>
manager. Each relevant part is split into a unique item which ease the
navigation as well as the configuration. The most <b>important</b> code block is the
next one which allows the reading of this file by <code>datatools::properties</code> object.
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups for Geant4</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  ""</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Main configuration level</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Here, general options such as verbosity, debug flags are passed to sng4
manager. By the way, some of these options can be overloaded by the
<code>sng4_module</code> which configuration can be changed in <a href="simulation_config.html">the main simulation file</a>.
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"manager"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority      : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geant4 tracking verbosity flag (from 0 to 10):</span>
g4_tracking_verbosity : <span class="org-variable-name">integer</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geant4 visualization activation flag:</span>
g4_visualization      : <span class="org-variable-name">boolean</span> = false
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> Event generator</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The following code holds the <code>genbb</code> manager to give access to several primary
generators from neutrinoless double beta decay, to&nbsp;<sup>214</sup>Bi/<sup>208</sup>Tl contamination or
cosmic muon generator. See <a href="sngenbb_manager.html">sngenbb manager</a> file.
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"event_generator"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file for the embedded '::genbb::manager'</span>
manager.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@configuration:sngenbb_manager.conf"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.3</span> Vertex generation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
This part basically provides the location of vertex generator implemented by
<a href="https://nemo.lpc-caen.in2p3.fr/wiki/genvtx">genvtx</a>. See <a href="sngenvertex_manager.html">sngenvertex manager</a> file.
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"vertex_generator"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Main configuration file for the vertex generator manager</span>
manager.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@configuration:sngenvertex_manager.conf"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.4</span> Detector construction</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Main configuration file for the detector construction user object.
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"detector_construction"</span>]
</pre>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.4.1</span> Logging priority</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"fatal"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">2.4.2</span> GDML scheme and options</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
The Geometry Description Markup Language is an application-indepedent geometry
description format based on XML<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. It is used as Geant4 toolkit bindings
through <code>gemotools</code> converters.
 <div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara"> <a href="http://gdml.web.cern.ch/GDML">http://gdml.web.cern.ch/GDML</a> </p></div><br/></div>
</p>

<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Temporary directory for GDML file generation:</span>
gdml.tmp_dir         : string as <span class="org-variable-name">path</span> = <span class="org-string">"/tmp/${USER}/snemo_demo_g4.d"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Access mode to the GDML schema ("local" or "remote")</span>
gdml.schema_location : <span class="org-variable-name">string</span> = <span class="org-string">"local"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">"remote"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to skip GDML validation</span>
gdml.no_validation   : <span class="org-variable-name">boolean</span> = false
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">2.4.3</span> Step hit processors</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Step hit processors are used to convert Geant4 steps into detector hits for
SuperNEMO physics.
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging support for step hit processor factory</span>
hit_processor_factory.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file for the step hit processor factory:</span>
hit_processor_factory.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@configuration:step_hit_processor_manager.conf"</span>
</pre>
</div>
</div>
</div>
