sng4_manager.org
*** Sensitive detectors
This category defines sensitive detectors where special treatments of Geant4 steps
must be applied. This can be in direct relation with step hit processors defined above.
#+BEGIN_SRC shell
  #@description Parameters for the generation of 'sensitive hits' through 'sensitive detectors' :
  sensitive.detectors : string[4] = "calorimeter_SD" "xcalorimeter_SD" "gveto_SD" "tracker_SD"

  sensitive.calorimeter_SD.logging.priority                : string  = @variant(core:logging_priority|"warning")
  sensitive.calorimeter_SD.hits_buffer_capacity            : integer = 100
  sensitive.calorimeter_SD.record_alpha_quenching          : boolean = true
  sensitive.calorimeter_SD.record_track_id                 : boolean = true
  sensitive.calorimeter_SD.record_primary_particle         : boolean = true
  sensitive.calorimeter_SD.drop_zero_energy_deposit_steps  : boolean = false
  sensitive.calorimeter_SD.track_gamma                     : boolean = true

  sensitive.xcalorimeter_SD.logging.priority               : string  = @variant(core:logging_priority|"warning")
  sensitive.xcalorimeter_SD.hits_buffer_capacity           : integer = 100
  sensitive.xcalorimeter_SD.record_alpha_quenching         : boolean = true
  sensitive.xcalorimeter_SD.record_track_id                : boolean = true
  sensitive.xcalorimeter_SD.record_primary_particle        : boolean = true
  sensitive.xcalorimeter_SD.drop_zero_energy_deposit_steps : boolean = false
  sensitive.xcalorimeter_SD.track_gamma                    : boolean = true

  sensitive.gveto_SD.logging.priority                      : string  = @variant(core:logging_priority|"warning")
  sensitive.gveto_SD.hits_buffer_capacity                  : integer = 100
  sensitive.gveto_SD.record_alpha_quenching                : boolean = true
  sensitive.gveto_SD.record_track_id                       : boolean = true
  sensitive.gveto_SD.record_primary_particle               : boolean = true
  sensitive.gveto_SD.drop_zero_energy_deposit_steps        : boolean = false
  sensitive.gveto_SD.track_gamma                           : boolean = true

  sensitive.tracker_SD.logging.priority                    : string  = @variant(core:logging_priority|"warning")
  sensitive.tracker_SD.hits_buffer_capacity                : integer = 1000
  sensitive.tracker_SD.record_alpha_quenching              : boolean = true
  sensitive.tracker_SD.record_track_id                     : boolean = true
  sensitive.tracker_SD.record_primary_particle             : boolean = true
  sensitive.tracker_SD.drop_zero_energy_deposit_steps      : boolean = false
  sensitive.tracker_SD.track_gamma                         : boolean = true
#+END_SRC

*** Geant4 step hit limits
The following code defines geometry models where Geant4 steps are size limited.
#+BEGIN_SRC shell
  #@description List of geometry models with max steps:
  limits.list_of_volumes : string[7] =         \
      "source_external_strip.model.log"        \
      "source_internal_strip.model.log"        \
      "calorimeter_scin_block_front.model.log" \
      "calorimeter_scin_block_back.model.log"  \
      "xwall_scin_block.model.log"             \
      "gveto_scin_block.model.log"             \
      "drift_cell_core.model.log"

  #@description Max step length inside source strip:
  limits.max_step.source_external_strip.model.log : real as length = 10 um

  #@description Max step length inside source strip:
  limits.max_step.source_internal_strip.model.log : real as length = 10 um

  #@description Max step length inside front calorimeter scin block:
  limits.max_step.calorimeter_scin_block_front.model.log : real as length = 500 um

  #@description Max step length inside back calorimeter scin block:
  limits.max_step.calorimeter_scin_block_back.model.log  : real as length = 500 um

  #@description Max step length inside X-calorimeter scin block:
  limits.max_step.xwall_scin_block.model.log : real as length = 500 um

  #@description Max step length inside gamma veto scin block:
  limits.max_step.gveto_scin_block.model.log : real as length = 500 um

  #@description Max step length inside the drift cell volume
  limits.max_step.drift_cell_core.model.log  : real as length = 5 mm
#+END_SRC

*** Geant4 regions
Definition of Geant4 regions.
#+BEGIN_SRC shell
  #@description Flag to use G4 regions
  using_regions : boolean = true

  #@description List of regions
  regions : string[3] = "calorimeter" "tracker" "source"

  #@description List of attached volumes/models for 'calorimeter' region
  regions.calorimeter.volumes : string[4] =    \
      "calorimeter_scin_block_front.model.log" \
      "calorimeter_scin_block_back.model.log"  \
      "gveto_scin_block.model.log"             \
      "xwall_scin_block.model.log"

  #@description List of attached volumes/models for 'tracker' region
  regions.tracker.volumes : string[1] = "drift_cell_core.model.log"

  #@description List of attached volumes/models for 'source' region
  regions.source.volumes : string[2] =  \
      "source_external_strip.model.log" \
      "source_internal_strip.model.log"
#+END_SRC

