sng4_manager.html

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">2.4.4</span> Sensitive detectors</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
This category defines sensitive detectors where special treatments of Geant4 steps
must be applied. This can be in direct relation with step hit processors defined above.
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Parameters for the generation of 'sensitive hits' through 'sensitive detectors' :</span>
sensitive.detectors : <span class="org-variable-name">string</span>[4] = <span class="org-string">"calorimeter_SD"</span> <span class="org-string">"xcalorimeter_SD"</span> <span class="org-string">"gveto_SD"</span> <span class="org-string">"tracker_SD"</span>

sensitive.calorimeter_SD.logging.priority                : <span class="org-variable-name">string</span>  = @variant(core:logging_priority|<span class="org-string">"warning"</span>)
sensitive.calorimeter_SD.hits_buffer_capacity            : <span class="org-variable-name">integer</span> = 100
sensitive.calorimeter_SD.record_alpha_quenching          : <span class="org-variable-name">boolean</span> = true
sensitive.calorimeter_SD.record_track_id                 : <span class="org-variable-name">boolean</span> = true
sensitive.calorimeter_SD.record_primary_particle         : <span class="org-variable-name">boolean</span> = true
sensitive.calorimeter_SD.drop_zero_energy_deposit_steps  : <span class="org-variable-name">boolean</span> = false
sensitive.calorimeter_SD.track_gamma                     : <span class="org-variable-name">boolean</span> = true

sensitive.xcalorimeter_SD.logging.priority               : <span class="org-variable-name">string</span>  = @variant(core:logging_priority|<span class="org-string">"warning"</span>)
sensitive.xcalorimeter_SD.hits_buffer_capacity           : <span class="org-variable-name">integer</span> = 100
sensitive.xcalorimeter_SD.record_alpha_quenching         : <span class="org-variable-name">boolean</span> = true
sensitive.xcalorimeter_SD.record_track_id                : <span class="org-variable-name">boolean</span> = true
sensitive.xcalorimeter_SD.record_primary_particle        : <span class="org-variable-name">boolean</span> = true
sensitive.xcalorimeter_SD.drop_zero_energy_deposit_steps : <span class="org-variable-name">boolean</span> = false
sensitive.xcalorimeter_SD.track_gamma                    : <span class="org-variable-name">boolean</span> = true

sensitive.gveto_SD.logging.priority                      : <span class="org-variable-name">string</span>  = @variant(core:logging_priority|<span class="org-string">"warning"</span>)
sensitive.gveto_SD.hits_buffer_capacity                  : <span class="org-variable-name">integer</span> = 100
sensitive.gveto_SD.record_alpha_quenching                : <span class="org-variable-name">boolean</span> = true
sensitive.gveto_SD.record_track_id                       : <span class="org-variable-name">boolean</span> = true
sensitive.gveto_SD.record_primary_particle               : <span class="org-variable-name">boolean</span> = true
sensitive.gveto_SD.drop_zero_energy_deposit_steps        : <span class="org-variable-name">boolean</span> = false
sensitive.gveto_SD.track_gamma                           : <span class="org-variable-name">boolean</span> = true

sensitive.tracker_SD.logging.priority                    : <span class="org-variable-name">string</span>  = @variant(core:logging_priority|<span class="org-string">"warning"</span>)
sensitive.tracker_SD.hits_buffer_capacity                : <span class="org-variable-name">integer</span> = 1000
sensitive.tracker_SD.record_alpha_quenching              : <span class="org-variable-name">boolean</span> = true
sensitive.tracker_SD.record_track_id                     : <span class="org-variable-name">boolean</span> = true
sensitive.tracker_SD.record_primary_particle             : <span class="org-variable-name">boolean</span> = true
sensitive.tracker_SD.drop_zero_energy_deposit_steps      : <span class="org-variable-name">boolean</span> = false
sensitive.tracker_SD.track_gamma                         : <span class="org-variable-name">boolean</span> = true
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">2.4.5</span> Geant4 step hit limits</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
The following code defines geometry models where Geant4 steps are size limited.
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of geometry models with max steps:</span>
limits.list_of_volumes : <span class="org-variable-name">string</span>[7] =         <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"source_external_strip.model.log"</span>        <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"source_internal_strip.model.log"</span>        <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"calorimeter_scin_block_front.model.log"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"calorimeter_scin_block_back.model.log"</span>  <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"xwall_scin_block.model.log"</span>             <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"gveto_scin_block.model.log"</span>             <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"drift_cell_core.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside source strip:</span>
limits.max_step.source_external_strip.model.log : real as <span class="org-variable-name">length</span> = 10 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside source strip:</span>
limits.max_step.source_internal_strip.model.log : real as <span class="org-variable-name">length</span> = 10 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside front calorimeter scin block:</span>
limits.max_step.calorimeter_scin_block_front.model.log : real as <span class="org-variable-name">length</span> = 500 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside back calorimeter scin block:</span>
limits.max_step.calorimeter_scin_block_back.model.log  : real as <span class="org-variable-name">length</span> = 500 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside X-calorimeter scin block:</span>
limits.max_step.xwall_scin_block.model.log : real as <span class="org-variable-name">length</span> = 500 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside gamma veto scin block:</span>
limits.max_step.gveto_scin_block.model.log : real as <span class="org-variable-name">length</span> = 500 um

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max step length inside the drift cell volume</span>
limits.max_step.drift_cell_core.model.log  : real as <span class="org-variable-name">length</span> = 5 mm
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">2.4.6</span> Geant4 regions</h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
Definition of Geant4 regions.
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to use G4 regions</span>
using_regions : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of regions</span>
regions : <span class="org-variable-name">string</span>[3] = <span class="org-string">"calorimeter"</span> <span class="org-string">"tracker"</span> <span class="org-string">"source"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of attached volumes/models for 'calorimeter' region</span>
regions.calorimeter.volumes : <span class="org-variable-name">string</span>[4] =    <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"calorimeter_scin_block_front.model.log"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"calorimeter_scin_block_back.model.log"</span>  <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"gveto_scin_block.model.log"</span>             <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"xwall_scin_block.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of attached volumes/models for 'tracker' region</span>
regions.tracker.volumes : <span class="org-variable-name">string</span>[1] = <span class="org-string">"drift_cell_core.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of attached volumes/models for 'source' region</span>
regions.source.volumes : <span class="org-variable-name">string</span>[2] =  <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"source_external_strip.model.log"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"source_internal_strip.model.log"</span>
</pre>
</div>
</div>
</div>
