sng4_manager.org
*** Magnetic field
#+BEGIN_SRC shell
  #@description Flag to use magnetic field
  using_electromagnetic_field : boolean = true

  #@description Name of the magnetic field geometry plugin
  electromagnetic_field.plugin_name : string = "fields_driver"

  #@description SetDeltaChord miss distance (mm):
  electromagnetic_field.miss_distance : real as length = 0.5 mm

  #@description Logging priority threshold of the embedded Geant4 magnetic fields
  magnetic_field.logging.priority : string = "warning"

  #@description Name of the associated fields
  magnetic_field.associations : string[1] = "module"
#+END_SRC

** Physics list
In the development of a Geant4-based application, it is the user's
responsibility to decide which physics processes are required, and then to
include them in the physics list. The next lines are just aliases to relevant
phycical processes for SuperNEMO.
#+BEGIN_SRC shell
  [name="physics_list"]
#+END_SRC

*** Logging priority
#+BEGIN_SRC shell
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

*** SuperNEMO physics plugins
#+BEGIN_SRC shell
  #@description List of physics constructors
  physics_constructors.names : string[2] = "particles" "em"

  #@description Class ID of the physics constructors named 'particles'
  physics_constructors.particles.id     : string = "mctools::g4::particles_physics_constructor"

  #@description Configuration file of the physics constructors named 'particles'
  physics_constructors.particles.config : string as path = \
      "@configuration:snparticles.conf"

  #@description Class ID of the physics constructors named 'em'
  physics_constructors.em.id            : string = "mctools::g4::em_physics_constructor"

  #@description Configuration file of the physics constructors named 'em'
  physics_constructors.em.config        : string as path = \
      "@configuration:snem_processes.conf"
#+END_SRC

**** Particle physics constructor
:PROPERTIES:
:TANGLE: snparticles.conf
:END:
Quite experimental try to set particles used within SuperNEMO "framework".
#+BEGIN_SRC shell
  #@config Configuration parameters for the particles Geant4 physics constructor

  #@description The activation flag for geantinos (neutral and charged, default: 0)
  #use_geantinos               : boolean = false

  #@description The activation flag for optical photons (default: 0)
  #use_optical_photons         : boolean = false

  #@description The activation flag for muon leptons (default: 0)
  #use_muon_leptons         : boolean = false

  #@description The activation flag for tau leptons (default: 0)
  #use_tau_leptons          : boolean = false

  #@description The activation flag for light mesons (default: 0)
  #use_light_mesons         : boolean = false

  #@description The activation flag for charm mesons (default: 0)
  #use_charm_mesons         : boolean = false

  #@description The activation flag for bottom mesons (default: 0)
  #use_bottom_mesons        : boolean = false

  #@description The activation flag for nucleons (default: 1)
  use_nucleons             : boolean = true

  #@description The activation flag for strange baryons (default: 0)
  #use_strange_baryons      : boolean = false

  #@description The activation flag for charm baryons (default: 0)
  #use_charm_baryons        : boolean = false

  #@description The activation flag for bottom baryons (default: 0)
  #use_bottom_baryons       : boolean = false

  #@description The activation flag for light nuclei (default: 1)
  use_light_nuclei         : boolean = true

  #@description The activation flag for light anti-nuclei (default: 0)
  #use_light_anti_nuclei    : boolean = false

  #@description The activation flag for generic ion (default: 0)
  use_generic_ion          : boolean = true
#+END_SRC

**** EM physics process
:PROPERTIES:
:TANGLE: snem_processes.conf
:END:
***** Logging priority
#+BEGIN_SRC shell
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

***** General settings
#+BEGIN_SRC shell
  #@config Configuration parameters for the electro-magnetic Geant4 physics constructor

  #@description Electro-magntox interaction model (value in: "standard", "low_energy", "penelope")
  em.model : string = "standard"
#+END_SRC
