sng4_manager.html

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">2.4.7</span> Magnetic field</h4>
<div class="outline-text-4" id="text-2-4-7">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to use magnetic field</span>
using_electromagnetic_field : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Name of the magnetic field geometry plugin</span>
electromagnetic_field.plugin_name : <span class="org-variable-name">string</span> = <span class="org-string">"fields_driver"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description SetDeltaChord miss distance (mm):</span>
electromagnetic_field.miss_distance : real as <span class="org-variable-name">length</span> = 0.5 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority threshold of the embedded Geant4 magnetic fields</span>
magnetic_field.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Name of the associated fields</span>
magnetic_field.associations : <span class="org-variable-name">string</span>[1] = <span class="org-string">"module"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">2.5</span> Physics list</h3>
<div class="outline-text-3" id="text-2-5">
<p>
In the development of a Geant4-based application, it is the user's
responsibility to decide which physics processes are required, and then to
include them in the physics list. The next lines are just aliases to relevant
phycical processes for SuperNEMO.
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"physics_list"</span>]
</pre>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">2.5.1</span> Logging priority</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">2.5.2</span> SuperNEMO physics plugins</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of physics constructors</span>
physics_constructors.names : <span class="org-variable-name">string</span>[2] = <span class="org-string">"particles"</span> <span class="org-string">"em"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Class ID of the physics constructors named 'particles'</span>
physics_constructors.particles.id     : <span class="org-variable-name">string</span> = <span class="org-string">"mctools::g4::particles_physics_constructor"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file of the physics constructors named 'particles'</span>
physics_constructors.particles.config : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@configuration:snparticles.conf"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Class ID of the physics constructors named 'em'</span>
physics_constructors.em.id            : <span class="org-variable-name">string</span> = <span class="org-string">"mctools::g4::em_physics_constructor"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration file of the physics constructors named 'em'</span>
physics_constructors.em.config        : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@configuration:snem_processes.conf"</span>
</pre>
</div>
</div>

<ul class="org-ul"><li><a id="orgheadline14"></a>Particle physics constructor<br  /><div class="outline-text-5" id="text-orgheadline14">
<p>
Quite experimental try to set particles used within SuperNEMO "framework".
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration parameters for the particles Geant4 physics constructor</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for geantinos (neutral and charged, default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_geantinos               : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for optical photons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_optical_photons         : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon leptons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_muon_leptons         : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for tau leptons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_tau_leptons          : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for light mesons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_light_mesons         : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for charm mesons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_charm_mesons         : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for bottom mesons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_bottom_mesons        : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for nucleons (default: 1)</span>
use_nucleons             : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for strange baryons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_strange_baryons      : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for charm baryons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_charm_baryons        : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for bottom baryons (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_bottom_baryons       : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for light nuclei (default: 1)</span>
use_light_nuclei         : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for light anti-nuclei (default: 0)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">use_light_anti_nuclei    : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for generic ion (default: 0)</span>
use_generic_ion          : <span class="org-variable-name">boolean</span> = true
</pre>
</div>
</div></li>

<li><a id="orgheadline15"></a>EM physics process<br  /><div class="outline-text-5" id="text-orgheadline15">
</div>
<ul class="org-ul"><li><a id="orgheadline16"></a>Logging priority<br  /><div class="outline-text-6" id="text-orgheadline16">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline17"></a>General settings<br  /><div class="outline-text-6" id="text-orgheadline17">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration parameters for the electro-magnetic Geant4 physics constructor</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Electro-magntox interaction model (value in: "standard", "low_energy", "penelope")</span>
em.model : <span class="org-variable-name">string</span> = <span class="org-string">"standard"</span>
</pre>
</div>
</div></li>
