sng4_manager.html
<li><a id="orgheadline18"></a>Electrons/positrons<br  /><div class="outline-text-6" id="text-orgheadline18">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron ionisation (energy loss/delta ray production)</span>
em.electron.ionisation           : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron multiple scatterring process</span>
em.electron.multiple_scatterring : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron multiple scatterring process</span>
em.electron.multiple_scatterring.use_distance_to_boundary: <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The range factor for electron/positron multiple scatterring process</span>
em.electron.multiple_scatterring.range_factor: <span class="org-variable-name">real</span> = 0.005

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron bremsstrahlung process</span>
em.electron.bremsstrahlung       : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for electron/positron step limiter process</span>
em.electron.step_limiter         : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for positron pannihilation</span>
em.positron.annihilation         : <span class="org-variable-name">boolean</span> = true
</pre>
</div>
</div></li>
<li><a id="orgheadline19"></a>Gammas<br  /><div class="outline-text-6" id="text-orgheadline19">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Rayleigh scattering</span>
em.gamma.rayleigh_scattering  : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for photoelectric effect</span>
em.gamma.photo_electric       : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Compton scattering</span>
em.gamma.compton_scattering   : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for gamma conversion</span>
em.gamma.conversion           : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for gamma conversion to muons</span>
em.gamma.conversion_to_muons  : <span class="org-variable-name">boolean</span> = false
</pre>
</div>
</div></li>
<li><a id="orgheadline20"></a>Muons<br  /><div class="outline-text-6" id="text-orgheadline20">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon ionisation</span>
em.muon.ionisation           : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon multiple scatterring process</span>
em.muon.multiple_scatterring : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon pair production</span>
em.muon.pair_production      : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon bremsstrahlung process</span>
em.muon.bremsstrahlung       : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for muon step limiter process</span>
em.muon.step_limiter         : <span class="org-variable-name">boolean</span> = false
</pre>
</div>
</div></li>
<li><a id="orgheadline21"></a>Ions<br  /><div class="outline-text-6" id="text-orgheadline21">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for ion ionisation</span>
em.ion.ionisation           : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for ion multiple scatterring process</span>
em.ion.multiple_scatterring : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for ion step limiter process</span>
em.ion.step_limiter         : <span class="org-variable-name">boolean</span> = true
</pre>
</div>
</div></li>
<li><a id="orgheadline22"></a>Deexcitation<br  /><div class="outline-text-6" id="text-orgheadline22">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for deexcitation fluorescence process</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.fluo         : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Auger process</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.auger        : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for PIXE</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.pixe         : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation model for PIXE cross-sections</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.pixe.model   : string = "Empirical"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The regions where to apply some deexcitation process</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions : string[2] = "A" "B"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for deexcitation fluorescence process in region "A"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.A.fluo  : boolean = true</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Auger process in region "A"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.A.auger : boolean = true</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for PIXE in region "A"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.A.pixe  : boolean = true</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for deexcitation fluorescence process in region "B"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.B.fluo  : boolean = true</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for Auger process in region "B"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.B.auger : boolean = true</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The activation flag for PIXE in region "B"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">em.deexcitation.regions.B.pixe  : boolean = true</span>
</pre>
</div>
</div></li></ul></li></ul>
</div>
