sng4_manager.org
*** Using Geant4 region cuts
These cuts are related to some production processes and then, define some
minimal step hit size given the detector region.
#+BEGIN_SRC shell
  #@description Activate the use of specific cuts
  using_production_cuts : boolean = true

  #@description The energy low edge for cuts
  production_cuts.low_energy    : real as energy  = 1 keV

  #@description The energy high edge for cuts
  production_cuts.high_energy   : real as energy = 100 MeV

  #@description The production cut default value
  production_cuts.default_value : real as length = 1.0 mm

  #@description The production cut for gamma
  production_cuts.gamma : real as length = 1.0 mm

  #@description The production cut for electron
  production_cuts.electron : real as length = 1.0 mm

  #@description The production cut for positron
  production_cuts.positron : real as length = 1.0 mm

  #@description The production cut for proton
  production_cuts.proton : real as length = 1.0 mm

  #@description List of region with production cut
  production_cuts.regions : string[3] = "calorimeter" "tracker" "source"

  #@description Production cut value for region "calorimeter"
  production_cuts.regions.calorimeter.gamma : real as length = 1.0 mm

  #@description Production cut value for region "calorimeter"
  production_cuts.regions.calorimeter.electron : real as length = 1.0 mm

  #@description Production cut value for region "tracker"
  production_cuts.regions.tracker.gamma : real as length = 0.5 mm

  #@description Production cut value for region "tracker"
  production_cuts.regions.tracker.electron : real as length = 0.5 mm

  #@description Production cut value for region "source"
  production_cuts.regions.source.gamma : real as length = 0.05 mm

  #@description Production cut value for region "source"
  production_cuts.regions.source.electron : real as length = 0.05 mm
#+END_SRC

** Geant4 related action
The last part of the configuration concerned Geant4 actions but do not hold a
lot of options.

*** Run action
#+BEGIN_SRC shell
  [name="run_action"]

  #@description Logging priority :
  logging.priority : string = "warning"

  #@description Run action event number print modulo :
  #number_events_modulo : integer = 100

  #@description If set, this flag forbids the generation of output files :
  file.no_save : boolean = true
#+END_SRC

*** Event action
#+BEGIN_SRC shell
  [name="event_action"]

  #@description Logging priority :
  logging.priority : string = "warning"
#+END_SRC

*** Primary generator action
#+BEGIN_SRC shell
  [name="primary_generator_action"]

  #@config Configuration of the primary generator action

  #@description Primary generator action logging priority
  logging.priority : string = "warning"
#+END_SRC
*** Tracking action
#+BEGIN_SRC shell
  [name="tracking_action"]

  #@description Logging priority :
  logging.priority : string = "warning"
#+END_SRC

*** Stepping action
#+BEGIN_SRC shell
  [name="stepping_action"]

  #@description Logging priority :
  logging.priority : string = "warning"
#+END_SRC

*** Stacking action
#+BEGIN_SRC shell
  [name="stacking_action"]

  #@description Logging priority :
  logging.priority : string = "warning"

  #@description Kill secondary particles within some volumes :
  # kill_particles : boolean = false

  #@description Kill secondary particles within some volumes :
  #kill_particles.volumes : string[1] = "drift_cell_core"

  #@description Kill secondary particles within some materials :
  #kill_particles.materials : string[1] = "tracking_gas"
#+END_SRC
