sng4_manager.html
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">2.5.3</span> Using Geant4 region cuts</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
These cuts are related to some production processes and then, define some
minimal step hit size given the detector region.
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Activate the use of specific cuts</span>
using_production_cuts : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The energy low edge for cuts</span>
production_cuts.low_energy    : real as <span class="org-variable-name">energy</span>  = 1 keV

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The energy high edge for cuts</span>
production_cuts.high_energy   : real as <span class="org-variable-name">energy</span> = 100 MeV

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut default value</span>
production_cuts.default_value : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for gamma</span>
production_cuts.gamma : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for electron</span>
production_cuts.electron : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for positron</span>
production_cuts.positron : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The production cut for proton</span>
production_cuts.proton : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of region with production cut</span>
production_cuts.regions : <span class="org-variable-name">string</span>[3] = <span class="org-string">"calorimeter"</span> <span class="org-string">"tracker"</span> <span class="org-string">"source"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "calorimeter"</span>
production_cuts.regions.calorimeter.gamma : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "calorimeter"</span>
production_cuts.regions.calorimeter.electron : real as <span class="org-variable-name">length</span> = 1.0 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "tracker"</span>
production_cuts.regions.tracker.gamma : real as <span class="org-variable-name">length</span> = 0.5 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "tracker"</span>
production_cuts.regions.tracker.electron : real as <span class="org-variable-name">length</span> = 0.5 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "source"</span>
production_cuts.regions.source.gamma : real as <span class="org-variable-name">length</span> = 0.05 mm

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Production cut value for region "source"</span>
production_cuts.regions.source.electron : real as <span class="org-variable-name">length</span> = 0.05 mm
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">2.6</span> Geant4 related action</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The last part of the configuration concerned Geant4 actions but do not hold a
lot of options.
</p>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">2.6.1</span> Run action</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"run_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Run action event number print modulo :</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">number_events_modulo : integer = 100</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description If set, this flag forbids the generation of output files :</span>
file.no_save : <span class="org-variable-name">boolean</span> = true
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">2.6.2</span> Event action</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"event_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">2.6.3</span> Primary generator action</h4>
<div class="outline-text-4" id="text-2-6-3">
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"primary_generator_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Configuration of the primary generator action</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Primary generator action logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">2.6.4</span> Tracking action</h4>
<div class="outline-text-4" id="text-2-6-4">
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"tracking_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">2.6.5</span> Stepping action</h4>
<div class="outline-text-4" id="text-2-6-5">
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"stepping_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">2.6.6</span> Stacking action</h4>
<div class="outline-text-4" id="text-2-6-6">
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"stacking_action"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority :</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Kill secondary particles within some volumes :</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">kill_particles : boolean = false</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Kill secondary particles within some volumes :</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">kill_particles.volumes : string[1] = "drift_cell_core"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Kill secondary particles within some materials :</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">kill_particles.materials : string[1] = "tracking_gas"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes"> </h2>
<div id="text-footnotes">



</div>
</div></div>
<div id="postamble" class="status">
File under <i class="fa fa-github-alt"></i> version control - commit <a href="https://github.com/xgarrido/snemo_simulation_configuration/commit/17f7cf010fcb6c91ac46c8c00adece2d7be03880">17f7cf0</a> - 2015-10-24
</div>
</body>
</html>
